<?php

$installer = $this;

$installer->startSetup();

$installer->run("
INSERT INTO `{$installer->getTable('directory_country_region')}` VALUES
(320,'CN','bj','北京'),(321,'CN','tj','天津'),(322,'CN','sh','上海'),(323,'CN','cq','重庆'),
(324,'CN','js','江苏省'),(325,'CN','zj','浙江省'),(326,'CN','ah','安徽省'),(327,'CN','fj','福建省'),
(328,'CN','hn','海南省'),(329,'CN','yn','云南省'),(330,'CN','sc','四川省'),(331,'CN','gz','贵州省'),
(332,'CN','hun','湖南省'),(333,'CN','gd','广东省'),(334,'CN','hen','河南省'),(335,'CN','hb','湖北省'),
(336,'CN','sd','山东省'),(337,'CN','heb','河北省'),(338,'CN','ln','辽宁省'),(339,'CN','jl','吉林省'),
(340,'CN','hlj','黑龙江省'),(341,'CN','sx','山西省'),(342,'CN','sxi','陕西省'),(343,'CN','gs','甘肃省'),
(344,'CN','qh','青海省'),(345,'CN','jx','江西省'),(346,'CN','xj','新疆维吾尔自治区'),(347,'CN','xz','西藏自治区'),
(348,'CN','nx','宁夏回族自治区'),(349,'CN','nm','内蒙古自治区'),(350,'CN','gx','广西壮族自治区'),
(351,'CN','hk','香港特别行政区'),(352,'CN','mk','澳门特别行政区'),(353,'CN','tw','台湾省');
    
");  


$installer->run("
INSERT INTO `{$installer->getTable('directory_country_region_name')}` VALUES
('zh_CN','320','北京'),('zh_CN','321','天津'),('zh_CN','322','上海'),('zh_CN','323','重庆'),
('zh_CN','324','江苏省'),('zh_CN','325','浙江省'),('zh_CN','326','安徽省'),('zh_CN','327','福建省'),
('zh_CN','328','海南省'),('zh_CN','329','云南省'),('zh_CN','330','四川省'),('zh_CN','331','贵州省'),
('zh_CN','332','湖南省'),('zh_CN','333','广东省'),('zh_CN','334','河南省'),('zh_CN','335','湖北省'),
('zh_CN','336','山东省'),('zh_CN','337','河北省'),('zh_CN','338','辽宁省'),('zh_CN','339','吉林省'),
('zh_CN','340','黑龙江省'),('zh_CN','341','山西省'),('zh_CN','342','陕西省'),('zh_CN','343','甘肃省'),
('zh_CN','344','青海省'),('zh_CN','345','江西省'),('zh_CN','346','新疆维吾尔自治区'),('zh_CN','347','西藏自治区'),
('zh_CN','348','宁夏回族自治区'),('zh_CN','349','内蒙古自治区'),('zh_CN','350','广西壮族自治区'),
('zh_CN','351','香港特别行政区'),('zh_CN','352','澳门特别行政区'),('zh_CN','353','台湾省');
    
");

$installer->endSetup(); 
